Ran Plan for 2 projects:

1. dir: `aws/dev/eks` workspace: `aws_dev_eks`
1. dir: `aws/dev/vpc` workspace: `aws_dev_vpc`
---

### 1. dir: `aws/dev/eks` workspace: `aws_dev_eks`
**Plan Error**
```
running "terragrunt plan -no-color -out=$PLANFILE" in "/home/ubuntu/.atlantis/repos/ahmedbadawy4/terraform-infrastructure/6/aws_dev_eks/aws/dev/eks": exit status 1: running "terragrunt plan -no-color -out=$PLANFILE" in "/home/ubuntu/.atlantis/repos/ahmedbadawy4/terraform-infrastructure/6/aws_dev_eks/aws/dev/eks": 
22:34:30.971 ERROR  ../vpc/terragrunt.hcl is a dependency of ./terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
22:34:30.971 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `aws/dev/vpc` workspace: `aws_dev_vpc`
<details><summary>Show Output</summary>

```diff
22:34:34.400 STDOUT terraform: data.aws_availability_zones.available: Reading...
22:34:34.730 STDOUT terraform: data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
22:34:34.980 STDOUT terraform: Terraform used the selected providers to generate the following execution
22:34:34.980 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
22:34:34.980 STDOUT terraform:   + create
22:34:34.980 STDOUT terraform: Terraform will perform the following actions:
22:34:34.980 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
22:34:34.981 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
22:34:34.981 STDOUT terraform:       + arn                    = (known after apply)
22:34:34.981 STDOUT terraform:       + default_network_acl_id = (known after apply)
22:34:34.981 STDOUT terraform:       + id                     = (known after apply)
22:34:34.981 STDOUT terraform:       + owner_id               = (known after apply)
22:34:34.981 STDOUT terraform:       + tags                   = {
22:34:34.981 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.981 STDOUT terraform:         }
22:34:34.981 STDOUT terraform:       + tags_all               = {
22:34:34.981 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.981 STDOUT terraform:         }
22:34:34.981 STDOUT terraform:       + vpc_id                 = (known after apply)
22:34:34.981 STDOUT terraform:       + egress {
22:34:34.981 STDOUT terraform:           + action          = "allow"
22:34:34.981 STDOUT terraform:           + from_port       = 0
22:34:34.981 STDOUT terraform:           + ipv6_cidr_block = "::/0"
22:34:34.981 STDOUT terraform:           + protocol        = "-1"
22:34:34.981 STDOUT terraform:           + rule_no         = 101
22:34:34.981 STDOUT terraform:           + to_port         = 0
22:34:34.981 STDOUT terraform:             # (1 unchanged attribute hidden)
22:34:34.981 STDOUT terraform:         }
22:34:34.981 STDOUT terraform:       + egress {
22:34:34.981 STDOUT terraform:           + action          = "allow"
22:34:34.981 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
22:34:34.981 STDOUT terraform:           + from_port       = 0
22:34:34.981 STDOUT terraform:           + protocol        = "-1"
22:34:34.981 STDOUT terraform:           + rule_no         = 100
22:34:34.981 STDOUT terraform:           + to_port         = 0
22:34:34.981 STDOUT terraform:             # (1 unchanged attribute hidden)
22:34:34.981 STDOUT terraform:         }
22:34:34.981 STDOUT terraform:       + ingress {
22:34:34.981 STDOUT terraform:           + action          = "allow"
22:34:34.982 STDOUT terraform:           + from_port       = 0
22:34:34.982 STDOUT terraform:           + ipv6_cidr_block = "::/0"
22:34:34.982 STDOUT terraform:           + protocol        = "-1"
22:34:34.982 STDOUT terraform:           + rule_no         = 101
22:34:34.982 STDOUT terraform:           + to_port         = 0
22:34:34.982 STDOUT terraform:             # (1 unchanged attribute hidden)
22:34:34.982 STDOUT terraform:         }
22:34:34.982 STDOUT terraform:       + ingress {
22:34:34.982 STDOUT terraform:           + action          = "allow"
22:34:34.982 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
22:34:34.982 STDOUT terraform:           + from_port       = 0
22:34:34.982 STDOUT terraform:           + protocol        = "-1"
22:34:34.982 STDOUT terraform:           + rule_no         = 100
22:34:34.982 STDOUT terraform:           + to_port         = 0
22:34:34.982 STDOUT terraform:             # (1 unchanged attribute hidden)
22:34:34.982 STDOUT terraform:         }
22:34:34.982 STDOUT terraform:     }
22:34:34.982 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
22:34:34.982 STDOUT terraform:   + resource "aws_default_route_table" "default" {
22:34:34.982 STDOUT terraform:       + arn                    = (known after apply)
22:34:34.982 STDOUT terraform:       + default_route_table_id = (known after apply)
22:34:34.982 STDOUT terraform:       + id                     = (known after apply)
22:34:34.982 STDOUT terraform:       + owner_id               = (known after apply)
22:34:34.982 STDOUT terraform:       + route                  = (known after apply)
22:34:34.982 STDOUT terraform:       + tags                   = {
22:34:34.983 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.983 STDOUT terraform:         }
22:34:34.983 STDOUT terraform:       + tags_all               = {
22:34:34.983 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.983 STDOUT terraform:         }
22:34:34.983 STDOUT terraform:       + vpc_id                 = (known after apply)
22:34:34.983 STDOUT terraform:       + timeouts {
22:34:34.983 STDOUT terraform:           + create = "5m"
22:34:34.983 STDOUT terraform:           + update = "5m"
22:34:34.983 STDOUT terraform:         }
22:34:34.983 STDOUT terraform:     }
22:34:34.983 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
22:34:34.983 STDOUT terraform:   + resource "aws_default_security_group" "this" {
22:34:34.983 STDOUT terraform:       + arn                    = (known after apply)
22:34:34.983 STDOUT terraform:       + description            = (known after apply)
22:34:34.983 STDOUT terraform:       + egress                 = (known after apply)
22:34:34.983 STDOUT terraform:       + id                     = (known after apply)
22:34:34.983 STDOUT terraform:       + ingress                = (known after apply)
22:34:34.983 STDOUT terraform:       + name                   = (known after apply)
22:34:34.983 STDOUT terraform:       + name_prefix            = (known after apply)
22:34:34.983 STDOUT terraform:       + owner_id               = (known after apply)
22:34:34.983 STDOUT terraform:       + revoke_rules_on_delete = false
22:34:34.983 STDOUT terraform:       + tags                   = {
22:34:34.983 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.983 STDOUT terraform:         }
22:34:34.983 STDOUT terraform:       + tags_all               = {
22:34:34.983 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:34:34.983 STDOUT terraform:         }
22:34:34.983 STDOUT terraform:       + vpc_id                 = (known after apply)
22:34:34.983 STDOUT terraform:     }
22:34:34.983 STDOUT terraform:   # module.vpc.aws_eip.nat[0] will be created
22:34:34.983 STDOUT terraform:   + resource "aws_eip" "nat" {
22:34:34.983 STDOUT terraform:       + allocation_id        = (known after apply)
22:34:34.983 STDOUT terraform:       + arn                  = (known after apply)
22:34:34.983 STDOUT terraform:       + association_id       = (known after apply)
22:34:34.983 STDOUT terraform:       + carrier_ip           = (known after apply)
22:34:34.983 STDOUT terraform:       + customer_owned_ip    = (known after apply)
22:34:34.983 STDOUT terraform:       + domain               = "vpc"
22:34:34.983 STDOUT terraform:       + id                   = (known after apply)
22:34:34.983 STDOUT terraform:       + instance             = (known after apply)
22:34:34.983 STDOUT terraform:       + network_border_group = (known after apply)
22:34:34.983 STDOUT terraform:       + network_interface    = (known after apply)
22:34:34.983 STDOUT terraform:       + private_dns          = (known after apply)
22:34:34.984 STDOUT terraform:       + private_ip           = (known after apply)
22:34:34.984 STDOUT terraform:       + ptr_record           = (known after apply)
22:34:34.984 STDOUT terraform:       + public_dns           = (known after apply)
22:34:34.984 STDOUT terraform:       + public_ip            = (known after apply)
22:34:34.984 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
22:34:34.984 STDOUT terraform:       + tags                 = {
22:34:34.984 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:34:34.984 STDOUT terraform:         }
22:34:34.984 STDOUT terraform:       + tags_all             = {
22:34:34.984 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:34:34.984 STDOUT terraform:         }
22:34:34.984 STDOUT terraform:       + vpc                  = (known after apply)
22:34:34.984 STDOUT terraform:     }
22:34:34.984 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
22:34:34.984 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
22:34:34.984 STDOUT terraform:       + arn      = (known after apply)
22:34:34.984 STDOUT terraform:       + id       = (known after apply)
22:34:34.984 STDOUT terraform:       + owner_id = (known after apply)
22:34:34.984 STDOUT terraform:       + tags     = {
22:34:34.984 STDOUT terraform:           + "Name" = "dev-vpc"
22:34:34.984 STDOUT terraform:         }
22:34:34.984 STDOUT terraform:       + tags_all = {
22:34:34.984 STDOUT terraform:           + "Name" = "dev-vpc"
22:34:34.984 STDOUT terraform:         }
22:34:34.984 STDOUT terraform:       + vpc_id   = (known after apply)
22:34:34.984 STDOUT terraform:     }
22:34:34.984 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
22:34:34.984 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
22:34:34.984 STDOUT terraform:       + allocation_id                      = (known after apply)
22:34:34.984 STDOUT terraform:       + association_id                     = (known after apply)
22:34:34.984 STDOUT terraform:       + connectivity_type                  = "public"
22:34:34.984 STDOUT terraform:       + id                                 = (known after apply)
22:34:34.984 STDOUT terraform:       + network_interface_id               = (known after apply)
22:34:34.984 STDOUT terraform:       + private_ip                         = (known after apply)
22:34:34.984 STDOUT terraform:       + public_ip                          = (known after apply)
22:34:34.984 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
22:34:34.984 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
22:34:34.984 STDOUT terraform:       + subnet_id                          = (known after apply)
22:34:34.984 STDOUT terraform:       + tags                               = {
22:34:34.984 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:34:34.984 STDOUT terraform:         }
22:34:34.984 STDOUT terraform:       + tags_all                           = {
22:34:34.985 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:34:34.985 STDOUT terraform:         }
22:34:34.985 STDOUT terraform:     }
22:34:34.985 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
22:34:34.985 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
22:34:34.985 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
22:34:34.985 STDOUT terraform:       + id                     = (known after apply)
22:34:34.985 STDOUT terraform:       + instance_id            = (known after apply)
22:34:34.985 STDOUT terraform:       + instance_owner_id      = (known after apply)
22:34:34.985 STDOUT terraform:       + nat_gateway_id         = (known after apply)
22:34:34.985 STDOUT terraform:       + network_interface_id   = (known after apply)
22:34:34.985 STDOUT terraform:       + origin                 = (known after apply)
22:34:34.985 STDOUT terraform:       + route_table_id         = (known after apply)
22:34:34.985 STDOUT terraform:       + state                  = (known after apply)
22:34:34.985 STDOUT terraform:       + timeouts {
22:34:34.985 STDOUT terraform:           + create = "5m"
22:34:34.985 STDOUT terraform:         }
22:34:34.985 STDOUT terraform:     }
22:34:34.985 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
22:34:34.985 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
22:34:34.985 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
22:34:34.985 STDOUT terraform:       + gateway_id             = (known after apply)
22:34:34.985 STDOUT terraform:       + id                     = (known after apply)
22:34:34.985 STDOUT terraform:       + instance_id            = (known after apply)
22:34:34.985 STDOUT terraform:       + instance_owner_id      = (known after apply)
22:34:34.985 STDOUT terraform:       + network_interface_id   = (known after apply)
22:34:34.985 STDOUT terraform:       + origin                 = (known after apply)
22:34:34.985 STDOUT terraform:       + route_table_id         = (known after apply)
22:34:34.985 STDOUT terraform:       + state                  = (known after apply)
22:34:34.985 STDOUT terraform:       + timeouts {
22:34:34.985 STDOUT terraform:           + create = "5m"
22:34:34.985 STDOUT terraform:         }
22:34:34.985 STDOUT terraform:     }
22:34:34.985 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
22:34:34.985 STDOUT terraform:   + resource "aws_route_table" "private" {
22:34:34.986 STDOUT terraform:       + arn              = (known after apply)
22:34:34.986 STDOUT terraform:       + id               = (known after apply)
22:34:34.986 STDOUT terraform:       + owner_id         = (known after apply)
22:34:34.986 STDOUT terraform:       + propagating_vgws = (known after apply)
22:34:34.986 STDOUT terraform:       + route            = (known after apply)
22:34:34.986 STDOUT terraform:       + tags             = {
22:34:34.986 STDOUT terraform:           + "Name" = "dev-vpc-private"
22:34:34.986 STDOUT terraform:         }
22:34:34.986 STDOUT terraform:       + tags_all         = {
22:34:34.986 STDOUT terraform:           + "Name" = "dev-vpc-private"
22:34:34.986 STDOUT terraform:         }
22:34:34.986 STDOUT terraform:       + vpc_id           = (known after apply)
22:34:34.986 STDOUT terraform:     }
22:34:34.986 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
22:34:34.986 STDOUT terraform:   + resource "aws_route_table" "public" {
22:34:34.986 STDOUT terraform:       + arn              = (known after apply)
22:34:34.986 STDOUT terraform:       + id               = (known after apply)
22:34:34.986 STDOUT terraform:       + owner_id         = (known after apply)
22:34:34.986 STDOUT terraform:       + propagating_vgws = (known after apply)
22:34:34.986 STDOUT terraform:       + route            = (known after apply)
22:34:34.986 STDOUT terraform:       + tags             = {
22:34:34.986 STDOUT terraform:           + "Name" = "dev-vpc-public"
22:34:34.986 STDOUT terraform:         }
22:34:34.986 STDOUT terraform:       + tags_all         = {
22:34:34.986 STDOUT terraform:           + "Name" = "dev-vpc-public"
22:34:34.986 STDOUT terraform:         }
22:34:34.986 STDOUT terraform:       + vpc_id           = (known after apply)
22:34:34.986 STDOUT terraform:     }
22:34:34.986 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
22:34:34.986 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:34:34.986 STDOUT terraform:       + id             = (known after apply)
22:34:34.986 STDOUT terraform:       + route_table_id = (known after apply)
22:34:34.986 STDOUT terraform:       + subnet_id      = (known after apply)
22:34:34.986 STDOUT terraform:     }
22:34:34.986 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
22:34:34.986 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:34:34.986 STDOUT terraform:       + id             = (known after apply)
22:34:34.987 STDOUT terraform:       + route_table_id = (known after apply)
22:34:34.987 STDOUT terraform:       + subnet_id      = (known after apply)
22:34:34.987 STDOUT terraform:     }
22:34:34.987 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
22:34:34.987 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:34:34.987 STDOUT terraform:       + id             = (known after apply)
22:34:34.987 STDOUT terraform:       + route_table_id = (known after apply)
22:34:34.987 STDOUT terraform:       + subnet_id      = (known after apply)
22:34:34.987 STDOUT terraform:     }
22:34:34.987 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
22:34:34.987 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:34:34.987 STDOUT terraform:       + id             = (known after apply)
22:34:34.987 STDOUT terraform:       + route_table_id = (known after apply)
22:34:34.987 STDOUT terraform:       + subnet_id      = (known after apply)
22:34:34.987 STDOUT terraform:     }
22:34:34.987 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
22:34:34.987 STDOUT terraform:   + resource "aws_subnet" "private" {
22:34:34.987 STDOUT terraform:       + arn                                            = (known after apply)
22:34:34.987 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:34:34.987 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:34:34.987 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:34:34.987 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
22:34:34.987 STDOUT terraform:       + enable_dns64                                   = false
22:34:34.987 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:34:34.987 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:34:34.987 STDOUT terraform:       + id                                             = (known after apply)
22:34:34.987 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:34:34.988 STDOUT terraform:       + ipv6_native                                    = false
22:34:34.988 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:34:34.988 STDOUT terraform:       + owner_id                                       = (known after apply)
22:34:34.988 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:34:34.988 STDOUT terraform:       + tags                                           = {
22:34:34.988 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
22:34:34.988 STDOUT terraform:         }
22:34:34.988 STDOUT terraform:       + tags_all                                       = {
22:34:34.988 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
22:34:34.988 STDOUT terraform:         }
22:34:34.988 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:34:34.988 STDOUT terraform:     }
22:34:34.988 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
22:34:34.988 STDOUT terraform:   + resource "aws_subnet" "private" {
22:34:34.988 STDOUT terraform:       + arn                                            = (known after apply)
22:34:34.988 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:34:34.988 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:34:34.988 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:34:34.988 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
22:34:34.988 STDOUT terraform:       + enable_dns64                                   = false
22:34:34.988 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:34:34.988 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:34:34.988 STDOUT terraform:       + id                                             = (known after apply)
22:34:34.989 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:34:34.989 STDOUT terraform:       + ipv6_native                                    = false
22:34:34.989 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:34:34.989 STDOUT terraform:       + owner_id                                       = (known after apply)
22:34:34.989 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:34:34.989 STDOUT terraform:       + tags                                           = {
22:34:34.989 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
22:34:34.989 STDOUT terraform:         }
22:34:34.989 STDOUT terraform:       + tags_all                                       = {
22:34:34.989 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
22:34:34.989 STDOUT terraform:         }
22:34:34.989 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:34:34.989 STDOUT terraform:     }
22:34:34.989 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
22:34:34.989 STDOUT terraform:   + resource "aws_subnet" "public" {
22:34:34.989 STDOUT terraform:       + arn                                            = (known after apply)
22:34:34.989 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:34:34.989 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:34:34.989 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:34:34.989 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
22:34:34.989 STDOUT terraform:       + enable_dns64                                   = false
22:34:34.989 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:34:34.989 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:34:34.989 STDOUT terraform:       + id                                             = (known after apply)
22:34:34.989 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:34:34.990 STDOUT terraform:       + ipv6_native                                    = false
22:34:34.990 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:34:34.990 STDOUT terraform:       + owner_id                                       = (known after apply)
22:34:34.990 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:34:34.990 STDOUT terraform:       + tags                                           = {
22:34:34.990 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
22:34:34.990 STDOUT terraform:         }
22:34:34.990 STDOUT terraform:       + tags_all                                       = {
22:34:34.990 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
22:34:34.990 STDOUT terraform:         }
22:34:34.990 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:34:34.990 STDOUT terraform:     }
22:34:34.990 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
22:34:34.990 STDOUT terraform:   + resource "aws_subnet" "public" {
22:34:34.990 STDOUT terraform:       + arn                                            = (known after apply)
22:34:34.990 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:34:34.990 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:34:34.990 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:34:34.990 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
22:34:34.990 STDOUT terraform:       + enable_dns64                                   = false
22:34:34.990 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:34:34.990 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:34:34.990 STDOUT terraform:       + id                                             = (known after apply)
22:34:34.990 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:34:34.990 STDOUT terraform:       + ipv6_native                                    = false
22:34:34.990 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:34:34.990 STDOUT terraform:       + owner_id                                       = (known after apply)
22:34:34.990 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:34:34.990 STDOUT terraform:       + tags                                           = {
22:34:34.991 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
22:34:34.991 STDOUT terraform:         }
22:34:34.991 STDOUT terraform:       + tags_all                                       = {
22:34:34.991 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
22:34:34.991 STDOUT terraform:         }
22:34:34.991 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:34:34.991 STDOUT terraform:     }
22:34:34.991 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
22:34:34.991 STDOUT terraform:   + resource "aws_vpc" "this" {
22:34:34.991 STDOUT terraform:       + arn                                  = (known after apply)
22:34:34.991 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
22:34:34.991 STDOUT terraform:       + default_network_acl_id               = (known after apply)
22:34:34.991 STDOUT terraform:       + default_route_table_id               = (known after apply)
22:34:34.991 STDOUT terraform:       + default_security_group_id            = (known after apply)
22:34:34.991 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
22:34:34.991 STDOUT terraform:       + enable_dns_hostnames                 = true
22:34:34.991 STDOUT terraform:       + enable_dns_support                   = true
22:34:34.991 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
22:34:34.991 STDOUT terraform:       + id                                   = (known after apply)
22:34:34.991 STDOUT terraform:       + instance_tenancy                     = "default"
22:34:34.991 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
22:34:34.991 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
22:34:34.991 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
22:34:34.991 STDOUT terraform:       + main_route_table_id                  = (known after apply)
22:34:34.991 STDOUT terraform:       + owner_id                             = (known after apply)
22:34:34.991 STDOUT terraform:       + tags                                 = {
22:34:34.991 STDOUT terraform:           + "Name" = "dev-vpc"
22:34:34.992 STDOUT terraform:         }
22:34:34.992 STDOUT terraform:       + tags_all                             = {
22:34:34.992 STDOUT terraform:           + "Name" = "dev-vpc"
22:34:34.992 STDOUT terraform:         }
22:34:34.992 STDOUT terraform:     }
22:34:34.992 STDOUT terraform: Plan: 19 to add, 0 to change, 0 to destroy.
22:34:34.992 STDOUT terraform: Changes to Outputs:
22:34:34.992 STDOUT terraform:   + private_subnets = [
22:34:34.992 STDOUT terraform:       + (known after apply),
22:34:34.992 STDOUT terraform:       + (known after apply),
22:34:34.992 STDOUT terraform:     ]
22:34:34.992 STDOUT terraform:   + public_subnets  = [
22:34:34.992 STDOUT terraform:       + (known after apply),
22:34:34.992 STDOUT terraform:       + (known after apply),
22:34:34.992 STDOUT terraform:     ]
22:34:34.992 STDOUT terraform:   + vpc_id          = (known after apply)
22:34:34.992 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
22:34:34.992 STDOUT terraform: Saved the plan to:
22:34:34.992 STDOUT terraform: ./aws_dev_vpc.tfplan
22:34:34.992 STDOUT terraform: To perform exactly these actions, run the following command to apply:
22:34:34.992 STDOUT terraform:     terraform apply "./aws_dev_vpc.tfplan"

22:34:38.225 INFO   Retrieved output from terraform
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d aws/dev/vpc -w aws_dev_vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-17-75:4141/lock?id=ahmedbadawy4%252Fterraform-infrastructure%252Faws%252Fdev%252Fvpc%252Faws_dev_vpc)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d aws/dev/vpc -w aws_dev_vpc
  ```
Plan: 19 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```